NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/bootloader_mesh.c
                /* if the host doesn't know the start address, we use start of segment: */
                if (p_packet->payload.start.start_address == START_ADDRESS_UNKNOWN)
                {
                    p_packet->payload.start.start_address = p_segment->start;
                }

                uint32_t segment_count = ((p_packet->payload.start.length * 4) + (p_packet->payload.start.start_address & 0x0F) - 1) / 16 + 1;
                if (segment_count > 0xFFFF)
                {
                    /* can't have more than 65536 segments in a transmission */
                    segment_count = 0xFFFF;
                }

                m_transaction.segments_remaining                = segment_count;
                m_transaction.segment_count                     = segment_count;
                m_transaction.p_start_addr                      = (uint32_t*) p_packet->payload.start.start_address;
                m_transaction.length                            = p_packet->payload.start.length * 4;
                m_transaction.signature_length                  = p_packet->payload.start.signature_length;
                m_transaction.segment_is_valid_after_transfer   = p_packet->payload.start.last;
                m_transaction.p_last_requested_entry            = NULL;

                if (m_transaction.type == DFU_TYPE_BOOTLOADER)
                {
                    m_transaction.p_bank_addr = (uint32_t*) (
                        (m_bl_info_pointers.p_segment_app->start) +
                        (m_bl_info_pointers.p_segment_app->length) -
                        (m_transaction.length & ((uint32_t) ~(PAGE_SIZE - 1))) -
                        (PAGE_SIZE)
                    );
                }
                else
                {
                    m_transaction.p_bank_addr = m_transaction.p_start_addr;
                }

                if ((uint32_t) m_transaction.p_start_addr >= p_segment->start &&
                    (uint32_t) m_transaction.p_start_addr + m_transaction.length <= p_segment->start + p_segment->length)
                {
                    start_target();
                    do_relay = true;
                }
            }
            else
            {
                m_tid_cache[(m_tid_index++) & (TRANSACTION_ID_CACHE_SIZE - 1)] = m_transaction.transaction_id;
                start_req(m_transaction.type, true); /* go back to req, we've missed packet 0 */
            }
        }
        else if (m_state == BL_STATE_DFU_TARGET)
        {
            switch (p_packet->payload.start.segment)
            {
                case 0:
                    /* ignore a repeated start message */
                    break;

                default:
                    if (p_packet->payload.data.segment <= m_transaction.segment_count)
                    {
                        uint32_t* p_addr = addr_from_seg(p_packet->payload.data.segment);
                        uint32_t error_code = dfu_data((uint32_t) p_addr,
                                                       p_packet->payload.data.data,
                                                       length - (DFU_PACKET_LEN_DATA - SEGMENT_LENGTH));
                        if (error_code == NRF_SUCCESS)
                        {
                            set_timeout(STATE_TIMEOUT_TARGET);
                            m_transaction.segments_remaining--;
                            do_relay = true;
                            /* check whether we've lost any entries, and request them */
                            volatile uint32_t* p_req_entry = NULL;
                            uint32_t req_entry_len = 0;
                            mesh_packet_t* p_req_packet;
                            if (dfu_get_oldest_missing_entry(
                                    m_transaction.p_last_requested_entry,
                                    &p_req_entry,
                                    &req_entry_len))
                            {
                                if(!mesh_packet_acquire(&p_req_packet))
                                {
                                    break;
                                }
                                if (mesh_packet_build(p_req_packet,
                                        DFU_PACKET_TYPE_DATA_REQ,
                                        ADDR_SEGMENT(p_req_entry, m_transaction.p_start_addr),
                                        (uint8_t*) &m_transaction.transaction_id,
                                        4) == NRF_SUCCESS &&
                                    transport_tx(p_req_packet, TX_REPEATS_REQ, TX_INTERVAL_TYPE_REQ, NULL))
                                {
                                    m_transaction.p_last_requested_entry = (uint32_t*) p_req_entry;
                                }
                                mesh_packet_ref_count_dec(p_req_packet);
                            }
                        }
                        else if (error_code == NRF_ERROR_INVALID_STATE)
                        {
                            /* redundant RX, skip TX for this sequence number this interval */
                            NVIC_DisableIRQ(RTC0_IRQn);
                            for (uint32_t i = 0; i < SENT_PACKET_COUNT; ++i)
                            {
                                if (mp_sent_packets[i] && 
                                    ((mesh_dfu_adv_data_t*) mp_sent_packets[i]->payload)->dfu_packet.payload.data.segment == 
                                    p_packet->payload.data.segment)
                                {
                                    transport_tx_skip(mp_sent_packets[i]);
                                    break;
                                }
                            }
                            NVIC_EnableIRQ(RTC0_IRQn);
                        }

                    }
            }

            /* ending the DFU */
            if (m_transaction.segments_remaining == 0)
            {
                dfu_end();
                
                if (signature_check())
                {
                    /* write new version in bl info: */
                    bl_info_entry_t new_version_entry;
                    memcpy(&new_version_entry.version, m_bl_info_pointers.p_fwid, sizeof(fwid_t));
                    switch (m_transaction.type)
                    {
                        case DFU_TYPE_APP:
                            memcpy((void*) &new_version_entry.version.app, (void*) &m_transaction.target_fwid_union.app, DFU_FWID_LEN_APP);
                            break;
                        case DFU_TYPE_SD:
                            memcpy((void*) &new_version_entry.version.sd, (void*) &m_transaction.target_fwid_union.sd, DFU_FWID_LEN_SD);
                            break;
                        case DFU_TYPE_BOOTLOADER:
                            memcpy((void*) &new_version_entry.version.bootloader, (void*) &m_transaction.target_fwid_union.bootloader, DFU_FWID_LEN_BL);
                            break;
                        default:
                            break;
                    }
                    m_bl_info_pointers.p_fwid = &bootloader_info_entry_put(BL_INFO_TYPE_VERSION, &new_version_entry, BL_INFO_LEN_FWID)->version;
                    
                    /* remove finished journal */
                    bootloader_info_entry_invalidate((uint32_t*) BOOTLOADER_INFO_ADDRESS, BL_INFO_TYPE_JOURNAL);
                    
                    /* prepare to reboot */
                    start_rampdown();
                }
                else
                {
                    /* someone gave us anauthorized firmware, and we're broken.
                       need to reboot and try to request a new transfer */
                    bootloader_abort(BL_END_ERROR_UNAUTHORIZED);
                }
            }
        }
    }

    if (do_relay)
    {
        mesh_packet_t* p_mesh_packet = mesh_packet_get_aligned(p_packet);
        if (!p_mesh_packet)
        {
            if (!mesh_packet_acquire(&p_mesh_packet))
            {
                APP_ERROR_CHECK(NRF_ERROR_NO_MEM);
            }
            mesh_packet_build(
                p_mesh_packet,
                p_packet->packet_type,
                p_packet->payload.data.segment,
                (uint8_t*) &p_packet->payload.data.transaction_id,
                length - 4);
        }
        else
        {
            mesh_packet_ref_count_inc(p_mesh_packet);
        }

        mesh_packet_set_local_addr(p_mesh_packet);

