NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/bootloader_mesh.c
        transport_tx(p_mesh_packet, TX_REPEATS_DATA, TX_INTERVAL_TYPE_DATA, packet_release_callback);
        mp_sent_packets[(m_sent_packet_index++) & (SENT_PACKET_COUNT - 1)] = p_mesh_packet;
        mesh_packet_ref_count_dec(p_mesh_packet);
    }
}

static void handle_state_packet(dfu_packet_t* p_packet)
{
    switch (m_state)
    {
        case BL_STATE_FIND_FWID:
            if (p_packet->payload.state.authority > 0 &&
                ready_packet_is_upgrade(p_packet))
            {
                m_transaction.type = (dfu_type_t) p_packet->payload.state.dfu_type;
                switch (m_transaction.type)
                {
                    case DFU_TYPE_APP:
                        memcpy(&m_transaction.target_fwid_union, 
                               &p_packet->payload.state.fwid.app, 
                               sizeof(app_id_t));
                        break;
                    case DFU_TYPE_SD:
                        m_transaction.target_fwid_union.sd = p_packet->payload.state.fwid.sd;
                        break;
                    case DFU_TYPE_BOOTLOADER:
                        memcpy(&m_transaction.target_fwid_union.bootloader, 
                               &p_packet->payload.state.fwid.bootloader, 
                               sizeof(bl_id_t));
                        break;
                    default: return;
                }
                
                start_ready(p_packet);
            }
            break;
        case BL_STATE_DFU_REQ:
            if (p_packet->payload.state.authority > 0 &&
                (
                 ready_packet_matches_our_req(p_packet) || 
                 ready_packet_is_upgrade(p_packet)
                )
               )
            {
                switch (m_transaction.type)
                {
                    case DFU_TYPE_APP:
                        memcpy(&m_transaction.target_fwid_union, 
                               &p_packet->payload.state.fwid.app, 
                               sizeof(app_id_t));
                        break;
                    case DFU_TYPE_SD:
                        m_transaction.target_fwid_union.sd = p_packet->payload.state.fwid.sd;
                        break;
                    case DFU_TYPE_BOOTLOADER:
                        memcpy(&m_transaction.target_fwid_union.bootloader, 
                               &p_packet->payload.state.fwid.bootloader, 
                               sizeof(bl_id_t));
                        break;
                    default: return;
                }
                start_ready(p_packet);
            }
            break;
        case BL_STATE_DFU_READY:
            if (ready_packet_matches_our_req(p_packet))
            {
                if (p_packet->payload.state.authority > m_transaction.authority ||
                    (
                     p_packet->payload.state.authority == m_transaction.authority &&
                     p_packet->payload.state.transaction_id > m_transaction.transaction_id
                    )
                   )
                {
                    m_transaction.authority = p_packet->payload.state.authority;
                    m_transaction.transaction_id = p_packet->payload.state.transaction_id;
                    update_state_beacon();
                }
            }
            break;
        default:
            break;
    }

}

static void handle_fwid_packet(dfu_packet_t* p_packet)
{
    if (m_state == BL_STATE_FIND_FWID)
    {
        /* always upgrade bootloader first */
        if (bootloader_is_newer(p_packet->payload.fwid.bootloader))
        {
            NRF_RTC0->INTENCLR = (1 << (RTC_BL_STATE_CH + RTC_INTENCLR_COMPARE0_Pos));
            m_transaction.target_fwid_union.bootloader = p_packet->payload.fwid.bootloader;
            start_req(DFU_TYPE_BOOTLOADER, true);
        }
        else if (app_is_newer(&p_packet->payload.fwid.app))
        {
            NRF_RTC0->INTENCLR = (1 << (RTC_BL_STATE_CH + RTC_INTENCLR_COMPARE0_Pos));
            /* SD shall only be upgraded if a newer version of our app requires a different SD */
            if (p_packet->payload.fwid.sd != 0xFFFE && p_packet->payload.fwid.sd != m_bl_info_pointers.p_fwid->sd)
            {
                m_transaction.target_fwid_union.sd = p_packet->payload.fwid.sd;
                start_req(DFU_TYPE_SD, true);
            }
            else
            {
                memcpy(&m_transaction.target_fwid_union.app, &p_packet->payload.fwid.app, sizeof(app_id_t));
                start_req(DFU_TYPE_APP, true);
            }
        }
    }
}

static void handle_data_req_packet(dfu_packet_t* p_packet)
{
    if (p_packet->payload.data.transaction_id == m_transaction.transaction_id)
    {
        mesh_packet_t* p_rsp;
        if (mesh_packet_acquire(&p_rsp))
        {
            /* check that we haven't served this request before. */
            for (uint32_t i = 0; i < REQ_CACHE_SIZE; ++i)
            {
                if (m_req_cache[i] == p_packet->payload.req_data.segment)
                {
                    mesh_packet_ref_count_dec(p_rsp);
                    return;
                }
            }
            /* serve request */
            if (
                dfu_has_entry(
                    (uint32_t*) SEGMENT_ADDR(p_packet->payload.req_data.segment, m_transaction.p_start_addr),
                    ((dfu_packet_t*) p_rsp->payload)->payload.rsp_data.data, SEGMENT_LENGTH)
               )
            {
                bootloader_packet_set_local_fields(p_rsp, DFU_PACKET_LEN_DATA);
                transport_tx(p_rsp, TX_REPEATS_RSP, TX_INTERVAL_TYPE_RSP, NULL);
            }
            mesh_packet_ref_count_dec(p_rsp);

            /* log our attempt at responding */
            m_req_cache[(m_req_index++) & (REQ_CACHE_SIZE - 1)] = p_packet->payload.req_data.segment;
        }
    }
}

static void handle_data_rsp_packet(dfu_packet_t* p_packet, uint16_t length)
{
    handle_data_packet(p_packet, length);
}

/*****************************************************************************
* Interface Functions
*****************************************************************************/
void bootloader_init(void)
{
    mp_beacon = NULL;
    m_state = BL_STATE_FIND_FWID;
    m_transaction.transaction_id = 0;
    m_transaction.type = DFU_TYPE_NONE;
    memset(m_req_cache, 0, REQ_CACHE_SIZE);
    memset(m_tid_cache, 0, TRANSACTION_ID_CACHE_SIZE);
    m_tid_index = 0;
    m_req_index = 0;


    /* fetch persistent entries */
    m_bl_info_pointers.p_flags              = &bootloader_info_entry_get((uint32_t*) BOOTLOADER_INFO_ADDRESS, BL_INFO_TYPE_FLAGS)->flags;
    m_bl_info_pointers.p_fwid               = &bootloader_info_entry_get((uint32_t*) BOOTLOADER_INFO_ADDRESS, BL_INFO_TYPE_VERSION)->version;
    m_bl_info_pointers.p_segment_app        = &bootloader_info_entry_get((uint32_t*) BOOTLOADER_INFO_ADDRESS, BL_INFO_TYPE_SEGMENT_APP)->segment;
    m_bl_info_pointers.p_segment_bl         = &bootloader_info_entry_get((uint32_t*) BOOTLOADER_INFO_ADDRESS, BL_INFO_TYPE_SEGMENT_BL)->segment;
    m_bl_info_pointers.p_segment_sd         = &bootloader_info_entry_get((uint32_t*) BOOTLOADER_INFO_ADDRESS, BL_INFO_TYPE_SEGMENT_SD)->segment;
    m_bl_info_pointers.p_ecdsa_public_key   = &bootloader_info_entry_get((uint32_t*) BOOTLOADER_INFO_ADDRESS, BL_INFO_TYPE_ECDSA_PUBLIC_KEY)->public_key[0];
    m_bl_info_pointers.p_journal            = &bootloader_info_entry_get((uint32_t*) BOOTLOADER_INFO_ADDRESS, BL_INFO_TYPE_JOURNAL)->journal[0];

    if (
        ((uint32_t) m_bl_info_pointers.p_flags              < BOOTLOADER_INFO_ADDRESS) ||
        ((uint32_t) m_bl_info_pointers.p_fwid               < BOOTLOADER_INFO_ADDRESS) ||
        ((uint32_t) m_bl_info_pointers.p_segment_app        < BOOTLOADER_INFO_ADDRESS) ||
        ((uint32_t) m_bl_info_pointers.p_segment_sd         < BOOTLOADER_INFO_ADDRESS) ||
        ((uint32_t) m_bl_info_pointers.p_segment_bl         < BOOTLOADER_INFO_ADDRESS)
       )
    {
        bootloader_abort(BL_END_ERROR_INVALID_PERSISTANT_STORAGE);
    }

    /* create journal */
    if ((uint32_t) m_bl_info_pointers.p_journal < BOOTLOADER_INFO_ADDRESS)
    {
        bl_info_entry_t journal_buffer;
        memset(&journal_buffer, 0xFF, BL_INFO_LEN_JOURNAL);
        m_bl_info_pointers.p_journal = &bootloader_info_entry_put(BL_INFO_TYPE_JOURNAL, &journal_buffer, BL_INFO_LEN_JOURNAL)->journal[0];

        if ((uint32_t) m_bl_info_pointers.p_journal < BOOTLOADER_INFO_ADDRESS)
        {
            bootloader_abort(BL_END_ERROR_INVALID_PERSISTANT_STORAGE);
        }
    }

    journal_init((uint32_t*) &m_bl_info_pointers.p_journal[0],
                 (uint32_t*) &m_bl_info_pointers.p_journal[BL_INFO_LEN_JOURNAL / 2]);

    if (!m_bl_info_pointers.p_flags->sd_intact ||
         m_bl_info_pointers.p_fwid->sd == SD_VERSION_INVALID)
    {
        m_transaction.target_fwid_union.sd = 0;
        start_req(DFU_TYPE_SD, false);
    }
    else if (!app_is_valid((uint32_t*) m_bl_info_pointers.p_segment_app->start, 
                           m_bl_info_pointers.p_segment_app->length))
    {
        memcpy(&m_transaction.target_fwid_union.app, &m_bl_info_pointers.p_fwid->app, sizeof(app_id_t));
        start_req(DFU_TYPE_APP, false);
    }
    else
    {
        start_find_fwid();
    }
}

uint32_t bootloader_rx(dfu_packet_t* p_packet, uint16_t length, bool from_serial)
{
    static bool led = false;
    if (led)
    {
        NRF_GPIO->OUTCLR = (1 << 22);
    }
    else
    {
        NRF_GPIO->OUTSET = (1 << 22);
    }
    led = !led;
    NRF_GPIO->OUTSET = (1 << 1);
    
    switch (p_packet->packet_type)
    {
        case DFU_PACKET_TYPE_FWID:
            handle_fwid_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_STATE:
            handle_state_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_DATA:
            handle_data_packet(p_packet, length);
            break;

